# Titanic DPP

In [1]:
## Load modules
import pandas as pd
import numpy as np
from IPython.display import display

## Get the data

In [2]:
data_path = 'C:/Repositories/Titanic/data/'
train = pd.read_csv(data_path + 'train.csv', index_col='PassengerId')
test = pd.read_csv(data_path + 'test.csv', index_col='PassengerId')
display(train.tail())
display(test.head())

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,NaN,Q

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Merge the two datasets

In [3]:
### Add 'Survived' column to the test set
test["Survived"] = np.nan
### Bind the datasets
full_dataset = pd.concat([train,test])
display(train.shape)
display(test.shape)
display(full_dataset.shape)

## Name column

Series and Index are equipped with a set of string processing methods that make it easy to operate on each element of the array. Perhaps most importantly, these methods exclude missing/NA values automatically. These are accessed via the `str` attribute and generally have names matching the equivalent (scalar) built-in string methods.

**NOTE**: Easy to expand this to return a DataFrame using `expand`.

Extracting Substrings:

### Get the titles

In [4]:
full_dataset.head()

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket
PassengerId,,,,,,,,,,,
1,22,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0,A/5 21171
2,38,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1,PC 17599
3,26,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,female,0,1,STON/O2. 3101282
4,35,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,female,1,1,113803
5,35,NaN,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0,373450

In [5]:
full_dataset['Name'].str.extract('(, [A-Za-z ]*.)').map(lambda x: str(x)[2:]).head()

PassengerId
1      Mr.
2     Mrs.
3    Miss.
4     Mrs.
5      Mr.
Name: Name, dtype: object

In [6]:
full_dataset['Title'] = full_dataset['Name'].str.extract('(, [A-Za-z ]*.)').map(lambda x: str(x)[2:])

### Get the first name

In [7]:
full_dataset['Name'].str.extract('(Mr\. |Miss\. |Master. |Mrs\.[A-Za-z ]*\()([A-Za-z]*)').head()

,0,1
PassengerId,,
1,Mr.,Owen
2,Mrs. John Bradley (,Florence
3,Miss.,Laina
4,Mrs. Jacques Heath (,Lily
5,Mr.,William

In [8]:
full_dataset['FirstName'] = full_dataset['Name'].str.extract('(Mr\. |Miss\. |Master. |Mrs\.[A-Za-z ]*\()([A-Za-z]*)')[1]

### Get the last name

In [9]:
full_dataset['Name'].str.extract('([A-Za-z ]*.),').map(lambda x: str(x)[0:-1]).head()

PassengerId
1       Braun
2      Cuming
3    Heikkine
4     Futrell
5        Alle
Name: Name, dtype: object

In [10]:
full_dataset['LastName'] = full_dataset['Name'].str.extract('([A-Za-z ]*.),').map(lambda x: str(x)[0:-1])

## Cabin column

Extract the deck (A,B,C,D,E,F,G)

In [11]:
full_dataset['Deck'] = full_dataset['Cabin'].str.extract('([A-Za-z])').str.upper()

## Split the datasets

In [12]:
train_DPP, test_DPP = full_dataset[:train.shape[0]], full_dataset[train.shape[0]:]
#display(train_DPP.shape)
#display(train.shape)

## Save the preprocessed data sets

In [13]:
train_DPP.to_csv(data_path + 'train_DPP.csv')
test_DPP.drop('Survived',1).to_csv(data_path + 'test_DPP.csv')

In [14]:
print('Done !')

Done !